[
  {
    "title": "Age of Anger",
    "authors": [
      "Pankaj Mishra"
    ],
    "publisher": "Macmillan",
    "publishedDate": "2017-02-07",
    "description": "A New York Times Notable Book of 2017 • Named a Best Book of the Year by Slate and NPR • Longlisted for the Orwell Prize One of our most important public intellectuals reveals the hidden history of our current global crisis How can we explain the origins of the great wave of paranoid hatreds that seem inescapable in our close-knit world—from American shooters and ISIS to Donald Trump, from a rise in vengeful nationalism across the world to racism and misogyny on social media? In Age of Anger, Pankaj Mishra answers our bewilderment by casting his gaze back to the eighteenth century before leading us to the present. He shows that as the world became modern, those who were unable to enjoy its promises—of freedom, stability, and prosperity—were increasingly susceptible to demagogues. The many who came late to this new world—or were left, or pushed, behind—reacted in horrifyingly similar ways: with intense hatred of invented enemies, attempts to re-create an imaginary golden age, and self-empowerment through spectacular violence. It was from among the ranks of the disaffected that the militants of the nineteenth century arose—angry young men who became cultural nationalists in Germany, messianic revolutionaries in Russia, bellicose chauvinists in Italy, and anarchist terrorists internationally. Today, just as then, the wide embrace of mass politics and technology and the pursuit of wealth and individualism have cast many more billions adrift in a demoralized world, uprooted from tradition but still far from modernity—with the same terrible results. Making startling connections and comparisons, Age of Anger is a book of immense urgency and profound argument. It is a history of our present predicament unlike any other.",
    "image": "http://books.google.com/books/content?id=qejZDQAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
    "language": "en",
    "averageRating": 3,
    "ratingsCount": 4,
    "categories": [
      "HISTORY"
    ],
    "pageCount": 417,
    "isbn10": "0374274789",
    "isbn13": "9780374274788",
    "googleBooks": {
      "id": "qejZDQAAQBAJ",
      "preview": "http://books.google.com/books?id=qejZDQAAQBAJ&printsec=frontcover&dq=intitle:Age+of+Anger+by+Pankaj+Mishra&hl=&cd=1&source=gbs_api",
      "info": "http://books.google.com/books?id=qejZDQAAQBAJ&dq=intitle:Age+of+Anger+by+Pankaj+Mishra&hl=&source=gbs_api",
      "canonical": "https://books.google.com/books/about/Age_of_Anger.html?hl=&id=qejZDQAAQBAJ"
    },
    "issueNumber": 6,
    "progressPercent": 0,
    "state": "want-to-read",
    "startedAt": "2023-01-11T10:56:12.000Z"
  },
  {
    "title": "Tropic of Cancer",
    "authors": [
      "Henry Miller"
    ],
    "publisher": "Miller, Henry",
    "publishedDate": "1961",
    "description": "The account of a young writer and his friends in free-wheeling Paris.",
    "image": "http://books.google.com/books/content?id=G54FAQAAIAAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api",
    "language": "en",
    "averageRating": 3,
    "ratingsCount": 45,
    "categories": [
      "Fiction"
    ],
    "pageCount": 360,
    "googleBooks": {
      "id": "G54FAQAAIAAJ",
      "preview": "http://books.google.com/books?id=G54FAQAAIAAJ&q=intitle:Tropic+of+Cancer+by+Henry+Miller&dq=intitle:Tropic+of+Cancer+by+Henry+Miller&hl=&cd=1&source=gbs_api",
      "info": "http://books.google.com/books?id=G54FAQAAIAAJ&dq=intitle:Tropic+of+Cancer+by+Henry+Miller&hl=&source=gbs_api",
      "canonical": "https://books.google.com/books/about/Tropic_of_Cancer.html?hl=&id=G54FAQAAIAAJ"
    },
    "issueNumber": 5,
    "progressPercent": 0,
    "state": "want-to-read",
    "startedAt": "2023-01-11T10:53:59.000Z"
  },
  {
    "title": "Austerity",
    "authors": [
      "Mark Blyth"
    ],
    "publisher": "Oxford University Press",
    "publishedDate": "2015",
    "description": "Selected as a Financial Times Best Book of 2013 Governments today in both Europe and the United States have succeeded in casting government spending as reckless wastefulness that has made the economy worse. In contrast, they have advanced a policy of draconian budget cuts--austerity--to solve the financial crisis. We are told that we have all lived beyond our means and now need to tighten our belts. This view conveniently forgets where all that debt came from. Not from an orgy of government spending, but as the direct result of bailing out, recapitalizing, and adding liquidity to the broken banking system. Through these actions private debt was rechristened as government debt while those responsible for generating it walked away scot free, placing the blame on the state, and the burden on the taxpayer. That burden now takes the form of a global turn to austerity, the policy of reducing domestic wages and prices to restore competitiveness and balance the budget. The problem, according to political economist Mark Blyth, is that austerity is a very dangerous idea. First of all, it doesn't work. As the past four years and countless historical examples from the last 100 years show, while it makes sense for any one state to try and cut its way to growth, it simply cannot work when all states try it simultaneously: all we do is shrink the economy. In the worst case, austerity policies worsened the Great Depression and created the conditions for seizures of power by the forces responsible for the Second World War: the Nazis and the Japanese military establishment. As Blyth amply demonstrates, the arguments for austerity are tenuous and the evidence thin. Rather than expanding growth and opportunity, the repeated revival of this dead economic idea has almost always led to low growth along with increases in wealth and income inequality. Austerity demolishes the conventional wisdom, marshaling an army of facts to demand that we austerity for what it is, and what it costs us.",
    "image": "http://books.google.com/books/content?id=H_8TDAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
    "language": "en",
    "averageRating": 3.5,
    "ratingsCount": 13,
    "categories": [
      "Business & Economics"
    ],
    "pageCount": 305,
    "isbn10": "0199389446",
    "isbn13": "9780199389445",
    "googleBooks": {
      "id": "H_8TDAAAQBAJ",
      "preview": "http://books.google.com/books?id=H_8TDAAAQBAJ&printsec=frontcover&dq=intitle:Austerity:+The+History+of+a+Dangerous+Idea+by+Mark+Blyth&hl=&cd=1&source=gbs_api",
      "info": "http://books.google.com/books?id=H_8TDAAAQBAJ&dq=intitle:Austerity:+The+History+of+a+Dangerous+Idea+by+Mark+Blyth&hl=&source=gbs_api",
      "canonical": "https://books.google.com/books/about/Austerity.html?hl=&id=H_8TDAAAQBAJ"
    },
    "issueNumber": 4,
    "progressPercent": 0,
    "state": "want-to-read",
    "startedAt": "2023-01-11T10:50:50.000Z"
  },
  {
    "title": "Clean Code",
    "authors": [
      "Robert C. Martin"
    ],
    "publisher": "Pearson Education",
    "publishedDate": "2009",
    "description": "Looks at the principles and clean code, includes case studies showcasing the practices of writing clean code, and contains a list of heuristics and \"smells\" accumulated from the process of writing clean code.",
    "image": "http://books.google.com/books/content?id=hjEFCAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
    "language": "en",
    "averageRating": 4.5,
    "ratingsCount": 10,
    "categories": [
      "Computers"
    ],
    "pageCount": 464,
    "isbn10": "0132350882",
    "isbn13": "9780132350884",
    "googleBooks": {
      "id": "hjEFCAAAQBAJ",
      "preview": "http://books.google.com/books?id=hjEFCAAAQBAJ&printsec=frontcover&dq=intitle:Clean+Code+by+Robert+Martin&hl=&cd=2&source=gbs_api",
      "info": "http://books.google.com/books?id=hjEFCAAAQBAJ&dq=intitle:Clean+Code+by+Robert+Martin&hl=&source=gbs_api",
      "canonical": "https://books.google.com/books/about/Clean_Code.html?hl=&id=hjEFCAAAQBAJ"
    },
    "issueNumber": 2,
    "progressPercent": 0,
    "state": "reading",
    "startedAt": "2023-01-11T02:50:57.000Z"
  }
]
