[
  {
    "title": "Age of Anger",
    "authors": [
      "Pankaj Mishra"
    ],
    "publisher": "Macmillan",
    "publishedDate": "2017-02-07",
    "description": "A New York Times Notable Book of 2017 • Named a Best Book of the Year by Slate and NPR • Longlisted for the Orwell Prize One of our most important public intellectuals reveals the hidden history of our current global crisis How can we explain the origins of the great wave of paranoid hatreds that seem inescapable in our close-knit world—from American shooters and ISIS to Donald Trump, from a rise in vengeful nationalism across the world to racism and misogyny on social media? In Age of Anger, Pankaj Mishra answers our bewilderment by casting his gaze back to the eighteenth century before leading us to the present. He shows that as the world became modern, those who were unable to enjoy its promises—of freedom, stability, and prosperity—were increasingly susceptible to demagogues. The many who came late to this new world—or were left, or pushed, behind—reacted in horrifyingly similar ways: with intense hatred of invented enemies, attempts to re-create an imaginary golden age, and self-empowerment through spectacular violence. It was from among the ranks of the disaffected that the militants of the nineteenth century arose—angry young men who became cultural nationalists in Germany, messianic revolutionaries in Russia, bellicose chauvinists in Italy, and anarchist terrorists internationally. Today, just as then, the wide embrace of mass politics and technology and the pursuit of wealth and individualism have cast many more billions adrift in a demoralized world, uprooted from tradition but still far from modernity—with the same terrible results. Making startling connections and comparisons, Age of Anger is a book of immense urgency and profound argument. It is a history of our present predicament unlike any other.",
    "image": "http://books.google.com/books/content?id=qejZDQAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
    "language": "en",
    "averageRating": 3,
    "ratingsCount": 4,
    "categories": [
      "HISTORY"
    ],
    "pageCount": 417,
    "isbn10": "0374274789",
    "isbn13": "9780374274788",
    "googleBooks": {
      "id": "qejZDQAAQBAJ",
      "preview": "http://books.google.com/books?id=qejZDQAAQBAJ&printsec=frontcover&dq=intitle:Age+of+Anger+by+Pankaj+Mishra&hl=&cd=1&source=gbs_api",
      "info": "http://books.google.com/books?id=qejZDQAAQBAJ&dq=intitle:Age+of+Anger+by+Pankaj+Mishra&hl=&source=gbs_api",
      "canonical": "https://books.google.com/books/about/Age_of_Anger.html?hl=&id=qejZDQAAQBAJ"
    },
    "issueNumber": 6,
    "progressPercent": 0,
    "state": "want-to-read",
    "startedAt": "2023-01-11T10:56:12.000Z"
  },
  {
    "title": "Tropic of Cancer",
    "authors": [
      "Henry Miller"
    ],
    "publisher": "Miller, Henry",
    "publishedDate": "1961",
    "description": "The account of a young writer and his friends in free-wheeling Paris.",
    "image": "http://books.google.com/books/content?id=G54FAQAAIAAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api",
    "language": "en",
    "averageRating": 3,
    "ratingsCount": 45,
    "categories": [
      "Fiction"
    ],
    "pageCount": 360,
    "googleBooks": {
      "id": "G54FAQAAIAAJ",
      "preview": "http://books.google.com/books?id=G54FAQAAIAAJ&q=intitle:Tropic+of+Cancer+by+Henry+Miller&dq=intitle:Tropic+of+Cancer+by+Henry+Miller&hl=&cd=1&source=gbs_api",
      "info": "http://books.google.com/books?id=G54FAQAAIAAJ&dq=intitle:Tropic+of+Cancer+by+Henry+Miller&hl=&source=gbs_api",
      "canonical": "https://books.google.com/books/about/Tropic_of_Cancer.html?hl=&id=G54FAQAAIAAJ"
    },
    "issueNumber": 5,
    "progressPercent": 0,
    "state": "want-to-read",
    "startedAt": "2023-01-11T10:53:59.000Z"
  },
  {
    "title": "Austerity",
    "authors": [
      "Mark Blyth"
    ],
    "publisher": "Oxford University Press",
    "publishedDate": "2015",
    "description": "Selected as a Financial Times Best Book of 2013 Governments today in both Europe and the United States have succeeded in casting government spending as reckless wastefulness that has made the economy worse. In contrast, they have advanced a policy of draconian budget cuts--austerity--to solve the financial crisis. We are told that we have all lived beyond our means and now need to tighten our belts. This view conveniently forgets where all that debt came from. Not from an orgy of government spending, but as the direct result of bailing out, recapitalizing, and adding liquidity to the broken banking system. Through these actions private debt was rechristened as government debt while those responsible for generating it walked away scot free, placing the blame on the state, and the burden on the taxpayer. That burden now takes the form of a global turn to austerity, the policy of reducing domestic wages and prices to restore competitiveness and balance the budget. The problem, according to political economist Mark Blyth, is that austerity is a very dangerous idea. First of all, it doesn't work. As the past four years and countless historical examples from the last 100 years show, while it makes sense for any one state to try and cut its way to growth, it simply cannot work when all states try it simultaneously: all we do is shrink the economy. In the worst case, austerity policies worsened the Great Depression and created the conditions for seizures of power by the forces responsible for the Second World War: the Nazis and the Japanese military establishment. As Blyth amply demonstrates, the arguments for austerity are tenuous and the evidence thin. Rather than expanding growth and opportunity, the repeated revival of this dead economic idea has almost always led to low growth along with increases in wealth and income inequality. Austerity demolishes the conventional wisdom, marshaling an army of facts to demand that we austerity for what it is, and what it costs us.",
    "image": "http://books.google.com/books/content?id=H_8TDAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
    "language": "en",
    "averageRating": 3.5,
    "ratingsCount": 13,
    "categories": [
      "Business & Economics"
    ],
    "pageCount": 305,
    "isbn10": "0199389446",
    "isbn13": "9780199389445",
    "googleBooks": {
      "id": "H_8TDAAAQBAJ",
      "preview": "http://books.google.com/books?id=H_8TDAAAQBAJ&printsec=frontcover&dq=intitle:Austerity:+The+History+of+a+Dangerous+Idea+by+Mark+Blyth&hl=&cd=1&source=gbs_api",
      "info": "http://books.google.com/books?id=H_8TDAAAQBAJ&dq=intitle:Austerity:+The+History+of+a+Dangerous+Idea+by+Mark+Blyth&hl=&source=gbs_api",
      "canonical": "https://books.google.com/books/about/Austerity.html?hl=&id=H_8TDAAAQBAJ"
    },
    "issueNumber": 4,
    "progressPercent": 0,
    "state": "want-to-read",
    "startedAt": "2023-01-11T10:50:50.000Z"
  },
  {
    "title": "Clean Code",
    "authors": [
      "Robert C. Martin"
    ],
    "publisher": "Pearson Education",
    "publishedDate": "2009",
    "description": "Looks at the principles and clean code, includes case studies showcasing the practices of writing clean code, and contains a list of heuristics and \"smells\" accumulated from the process of writing clean code.",
    "image": "http://books.google.com/books/content?id=hjEFCAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
    "language": "en",
    "averageRating": 4.5,
    "ratingsCount": 10,
    "categories": [
      "Computers"
    ],
    "pageCount": 464,
    "isbn10": "0132350882",
    "isbn13": "9780132350884",
    "googleBooks": {
      "id": "hjEFCAAAQBAJ",
      "preview": "http://books.google.com/books?id=hjEFCAAAQBAJ&printsec=frontcover&dq=intitle:Clean+Code+by+Robert+Martin&hl=&cd=2&source=gbs_api",
      "info": "http://books.google.com/books?id=hjEFCAAAQBAJ&dq=intitle:Clean+Code+by+Robert+Martin&hl=&source=gbs_api",
      "canonical": "https://books.google.com/books/about/Clean_Code.html?hl=&id=hjEFCAAAQBAJ"
    },
    "issueNumber": 2,
    "progressPercent": 0,
    "state": "reading",
    "startedAt": "2023-01-11T02:50:57.000Z"
  },
  {
    "title": "Domain-driven Design",
    "authors": [
      "Eric Evans",
      "Eric J. Evans"
    ],
    "publisher": "Addison-Wesley Professional",
    "publishedDate": "2004",
    "description": "Describes ways to incorporate domain modeling into software development.",
    "image": "http://books.google.com/books/content?id=xColAAPGubgC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
    "language": "en",
    "averageRating": 4.5,
    "ratingsCount": 6,
    "categories": [
      "Computers"
    ],
    "pageCount": 563,
    "isbn10": "0321125215",
    "isbn13": "9780321125217",
    "googleBooks": {
      "id": "xColAAPGubgC",
      "preview": "http://books.google.com/books?id=xColAAPGubgC&printsec=frontcover&dq=intitle:Domain-driven+Design+by+Eric+Evans&hl=&cd=1&source=gbs_api",
      "info": "http://books.google.com/books?id=xColAAPGubgC&dq=intitle:Domain-driven+Design+by+Eric+Evans&hl=&source=gbs_api",
      "canonical": "https://books.google.com/books/about/Domain_driven_Design.html?hl=&id=xColAAPGubgC"
    },
    "issueNumber": 9,
    "progressPercent": 0,
    "state": "want-to-read",
    "startedAt": "2020-09-10T00:00:00.000Z"
  },
  {
    "title": "The Age of Surveillance Capitalism",
    "authors": [
      "Shoshana Zuboff"
    ],
    "publisher": "PublicAffairs",
    "publishedDate": "2019-01-15",
    "description": "The challenges to humanity posed by the digital future, the first detailed examination of the unprecedented form of power called \"surveillance capitalism,\" and the quest by powerful corporations to predict and control our behavior. In this masterwork of original thinking and research, Shoshana Zuboff provides startling insights into the phenomenon that she has named surveillance capitalism. The stakes could not be higher: a global architecture of behavior modification threatens human nature in the twenty-first century just as industrial capitalism disfigured the natural world in the twentieth. Zuboff vividly brings to life the consequences as surveillance capitalism advances from Silicon Valley into every economic sector. Vast wealth and power are accumulated in ominous new \"behavioral futures markets,\" where predictions about our behavior are bought and sold, and the production of goods and services is subordinated to a new \"means of behavioral modification.\" The threat has shifted from a totalitarian Big Brother state to a ubiquitous digital architecture: a \"Big Other\" operating in the interests of surveillance capital. Here is the crucible of an unprecedented form of power marked by extreme concentrations of knowledge and free from democratic oversight. Zuboff's comprehensive and moving analysis lays bare the threats to twenty-first century society: a controlled \"hive\" of total connection that seduces with promises of total certainty for maximum profit -- at the expense of democracy, freedom, and our human future. With little resistance from law or society, surveillance capitalism is on the verge of dominating the social order and shaping the digital future -- if we let it.",
    "image": "http://books.google.com/books/content?id=lRqrDQAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
    "language": "en",
    "averageRating": 5,
    "ratingsCount": 1,
    "categories": [
      "Business & Economics"
    ],
    "pageCount": 704,
    "isbn10": "1610395700",
    "isbn13": "9781610395700",
    "googleBooks": {
      "id": "lRqrDQAAQBAJ",
      "preview": "http://books.google.com/books?id=lRqrDQAAQBAJ&printsec=frontcover&dq=intitle:The+Age+of+Surveillance+Capitalism+by+Shoshana+Zuboff&hl=&cd=1&source=gbs_api",
      "info": "https://play.google.com/store/books/details?id=lRqrDQAAQBAJ&source=gbs_api",
      "canonical": "https://play.google.com/store/books/details?id=lRqrDQAAQBAJ"
    },
    "issueNumber": 11,
    "progressPercent": 0,
    "state": "want-to-read",
    "startedAt": "2020-02-21T00:00:00.000Z"
  },
  {
    "title": "Farmers Or Hunter-Gatherers?",
    "authors": [
      "Peter Sutton",
      "Keryn Walshe"
    ],
    "publishedDate": "2021-06-16",
    "description": "\"An authoritative study of pre-colonial Australia that dismantles and reframes popular narratives of First Nations land management and food production. Australians' understanding of Aboriginal society prior to the British invasion from 1788 has been transformed since the publication of Bruce Pascoe's Dark Emu in 2014. It argued that classical Aboriginal society was more sophisticated than Australians had been led to believe because it resembled more closely the farming communities of Europe. In Farmers or Hunter-gatherers? Peter Sutton and Keryn Walshe ask why Australians have been so receptive to the notion that farming represents an advance from hunting and gathering. Drawing on the knowledge of Aboriginal elders, previously not included within this discussion, and decades of anthropological scholarship, Sutton and Walshe provide extensive evidence to support their argument that classical Aboriginal society was a hunter-gatherer society and as sophisticated as the traditional European farming methods. 'Farmers or Hunter-gatherers?' asks Australians to develop a deeper understanding and appreciation of Aboriginal society and culture\"--Publisher's description.",
    "image": "http://books.google.com/books/content?id=j7UnzgEACAAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api",
    "language": "en",
    "categories": [
      "Aboriginal Australians"
    ],
    "pageCount": 264,
    "isbn10": "0522877850",
    "isbn13": "9780522877854",
    "googleBooks": {
      "id": "j7UnzgEACAAJ",
      "preview": "http://books.google.com/books?id=j7UnzgEACAAJ&dq=intitle:Farmers+or+Hunter-gatherers%3F+The+Dark+Emu+debate&hl=&cd=1&source=gbs_api",
      "info": "http://books.google.com/books?id=j7UnzgEACAAJ&dq=intitle:Farmers+or+Hunter-gatherers%3F+The+Dark+Emu+debate&hl=&source=gbs_api",
      "canonical": "https://books.google.com/books/about/Farmers_Or_Hunter_Gatherers.html?hl=&id=j7UnzgEACAAJ"
    },
    "issueNumber": 12,
    "progressPercent": 0,
    "state": "want-to-read",
    "startedAt": "2019-11-13T00:00:00.000Z"
  },
  {
    "title": "Dark Emu",
    "authors": [
      "Bruce Pascoe"
    ],
    "publisher": "Magabala Books",
    "publishedDate": "2018-06-01",
    "description": "‘Dark Emu injects a profound authenticity into the conversation about how we Australians understand our continent ... [It is] essential reading for anyone who wants to understand what Australia once was, or what it might yet be if we heed the lessons of long and sophisticated human occupation.’ Judges for 2016 NSW Premier’s Literary Awards Dark Emu puts forward an argument for a reconsideration of the hunter-gatherer tag for pre-colonial Aboriginal Australians. The evidence insists that Aboriginal people right across the continent were using domesticated plants, sowing, harvesting, irrigating, and storing — behaviours inconsistent with the hunter-gatherer tag. Gerritsen and Gammage in their latest books support this premise but Pascoe takes this further and challenges the hunter-gatherer tag as a convenient lie. Almost all the evidence in Dark Emu comes from the records and diaries of the Australian explorers, impeccable sources. Bruce’s comments on his book compared to Gammage’s: “ My book is about food production, housing construction and clothing, whereas Gammage was interested in the appearance of the country at contact. [Gammage] doesn’t contest hunter gatherer labels either, whereas that is at the centre of my argument.”",
    "image": "http://books.google.com/books/content?id=6iZuDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
    "language": "en",
    "averageRating": 4,
    "ratingsCount": 8,
    "pageCount": 288,
    "isbn10": "1925768953",
    "isbn13": "9781925768954",
    "googleBooks": {
      "id": "6iZuDwAAQBAJ",
      "preview": "http://books.google.com/books?id=6iZuDwAAQBAJ&pg=PT173&dq=intitle:Dark+Emu+by+Bruce+Pascoe+(100%25)&hl=&cd=1&source=gbs_api",
      "info": "https://play.google.com/store/books/details?id=6iZuDwAAQBAJ&source=gbs_api",
      "canonical": "https://play.google.com/store/books/details?id=6iZuDwAAQBAJ"
    },
    "issueNumber": 13,
    "progressPercent": 0,
    "state": "reading",
    "startedAt": "2019-03-25T00:00:00.000Z"
  },
  {
    "title": "Practice",
    "authors": [
      "Guy Rundle"
    ],
    "publisher": "Black Incorporated",
    "publishedDate": "2019-03-05",
    "description": "Known for his wild wit and irreverent commentary, Guy Rundle is one of Australia's most virtuosic minds. Practicedistils his best writing on politics, culture, class and more. In it, Rundle roves the campaign trails of Obama, Palin and Trump; rides the Amtrak around a desolate America; bails up Bob Katter and Pauline Hanson; and excavates the deeper meanings of True Detective and Joy Division. Insightful and hilarious, Practicereveals Rundle as among Australia's sharpest and most entertaining minds, with a genuinely awe-inducing range and an utterly inimitable voice. There is only one Guy Rundle.",
    "image": "http://books.google.com/books/content?id=VHaSvQEACAAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api",
    "language": "en",
    "categories": [
      "Political Science"
    ],
    "pageCount": 382,
    "isbn10": "1760641316",
    "isbn13": "9781760641313",
    "googleBooks": {
      "id": "VHaSvQEACAAJ",
      "preview": "http://books.google.com/books?id=VHaSvQEACAAJ&dq=intitle:Practice+by+Guy+Rundle&hl=&cd=1&source=gbs_api",
      "info": "http://books.google.com/books?id=VHaSvQEACAAJ&dq=intitle:Practice+by+Guy+Rundle&hl=&source=gbs_api",
      "canonical": "https://books.google.com/books/about/Practice.html?hl=&id=VHaSvQEACAAJ"
    },
    "issueNumber": 14,
    "progressPercent": 0,
    "state": "reading",
    "startedAt": "2019-02-06T00:00:00.000Z"
  }
]
