[
  {
    "title": "Staff Engineer",
    "authors": [
      "Will Larson"
    ],
    "publishedDate": "2021-02-28",
    "description": "At most technology companies, you'll reach Senior Software Engineer, the career level for software engineers, in five to eight years. At that career level, you'll no longer be required to work towards the next pro? motion, and being promoted beyond it is exceptional rather than ex? pected. At that point your career path will branch, and you have to decide between remaining at your current level, continuing down the path of technical excellence to become a Staff Engineer, or switching into engineering management. Of course, the specific titles vary by company, and you can replace \"Senior Engineer\" and \"Staff Engineer\" with whatever titles your company prefers.Over the past few years we've seen a flurry of books unlocking the en? gineering management career path, like Camille Fournier's The Man? ager's Path, Julie Zhuo's The Making of a Manager, Lara Hogan's Re? silient Management and my own, An Elegant Puzzle. The manage? ment career isn't an easy one, but increasingly there are maps avail? able for navigating it.On the other hand, the transition into Staff Engineer, and its further evolutions like Principal and Distinguished Engineer, remains chal? lenging and undocumented. What are the skills you need to develop to reach Staff Engineer? Are technical abilities alone sufficient to reach and succeed in that role? How do most folks reach this role? What is your manager's role in helping you along the way? Will you enjoy being a Staff Engineer or you will toil for years to achieve a role that doesn't suit you?\"Staff Engineer: Leadership beyond the management track\" is a pragmatic look at attaining and operate in these Staff-plus roles.",
    "image": "https://tse2.mm.bing.net/th?q=Staff%20Engineer%20by%20Will%20Larson&w=256&c=7&rs=1&p=0&dpr=3&pid=1.7&mkt=en-IN&adlt=moderate",
    "language": "en",
    "isbn10": "1736417916",
    "isbn13": "9781736417911",
    "googleBooks": {
      "id": "1-M0zgEACAAJ",
      "preview": "http://books.google.com/books?id=1-M0zgEACAAJ&dq=intitle:Staff+Engineer:+Leadership+beyond+the+management+track+by+Will+Larson&hl=&cd=1&source=gbs_api",
      "info": "http://books.google.com/books?id=1-M0zgEACAAJ&dq=intitle:Staff+Engineer:+Leadership+beyond+the+management+track+by+Will+Larson&hl=&source=gbs_api",
      "canonical": "https://books.google.com/books/about/Staff_Engineer.html?hl=&id=1-M0zgEACAAJ"
    },
    "issueNumber": 46,
    "progressPercent": 0,
    "state": "completed",
    "startedAt": "2024-06-23T11:27:57.000Z",
    "completedAt": "2024-06-23T11:29:20.000Z",
    "timeToComplete": 83000,
    "timeToCompleteFormatted": "1 minute"
  },
  {
    "title": "Good Inside",
    "authors": [
      "Dr. Becky Kennedy"
    ],
    "publisher": "HarperCollins",
    "publishedDate": "2022-09-13",
    "description": "“This book is for any parent who has ever struggled under the substantial weight of caregiving—which is to say, all of us. Good Inside is not only a wise and practical guide to raising resilient, emotionally healthy kids, it’s also a supportive resource for overwhelmed parents who need more compassion and less stress. Dr. Becky is the smart, thoughtful, in-the-trenches parenting expert we’ve been waiting for!”—Eve Rodsky, New York Times bestselling author of Fair Play and Find Your Unicorn Space Dr. Becky Kennedy, wildly popular parenting expert and creator of @drbeckyatgoodinside, shares her groundbreaking approach to raising kids and offers practical strategies for parenting in a way that feels good. Over the past several years, Dr. Becky Kennedy—known to her followers as “Dr. Becky”—has been sparking a parenting revolution. Millions of parents, tired of following advice that either doesn’t work or simply doesn’t feel good, have embraced Dr. Becky’s empowering and effective approach, a model that prioritizes connecting with our kids over correcting them. Parents have long been sold a model of childrearing that simply doesn’t work. From reward charts to time outs, many popular parenting approaches are based on shaping behavior, not raising humans. These techniques don’t build the skills kids need for life, or account for their complex emotional needs. Add to that parents’ complicated relationships with their own upbringings, and it’s easy to see why so many caretakers feel lost, burned out, and worried they’re failing their kids. In Good Inside, Dr. Becky shares her parenting philosophy, complete with actionable strategies, that will help parents move from uncertainty and self-blame to confidence and sturdy leadership. Offering perspective-shifting parenting principles and troubleshooting for specific scenarios—including sibling rivalry, separation anxiety, tantrums, and more—Good Inside is a comprehensive resource for a generation of parents looking for a new way to raise their kids while still setting them up for a lifetime of self-regulation, confidence, and resilience.",
    "image": "http://books.google.com/books/content?id=TXJLEAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
    "language": "en",
    "categories": [
      "Family & Relationships"
    ],
    "pageCount": 206,
    "isbn10": "0063159473",
    "isbn13": "9780063159471",
    "googleBooks": {
      "id": "TXJLEAAAQBAJ",
      "preview": "http://books.google.com/books?id=TXJLEAAAQBAJ&printsec=frontcover&dq=intitle:Good+Inside:+A+Guide+to+Becoming+the+Parent+You+Want+to+Be+by+Dr+Becky+Kennedy&hl=&cd=1&source=gbs_api",
      "info": "https://play.google.com/store/books/details?id=TXJLEAAAQBAJ&source=gbs_api",
      "canonical": "https://play.google.com/store/books/details?id=TXJLEAAAQBAJ"
    },
    "issueNumber": 44,
    "progressPercent": 0,
    "state": "want-to-read",
    "startedAt": "2024-02-26T10:26:06.000Z"
  },
  {
    "title": "Team Topologies",
    "authors": [
      "Matthew Skelton",
      "Manuel Pais"
    ],
    "publisher": "It Revolution Press",
    "publishedDate": "2019-09-07",
    "description": "In Team Topologies IT consultants Matthew Skelton and Manuel Pais share secrets of successful team patterns and interactions for IT through four fundamental team topologies and three interaction modes.",
    "image": "http://books.google.com/books/content?id=oFdRuAEACAAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api",
    "language": "en",
    "categories": [
      "Business & Economics"
    ],
    "pageCount": 240,
    "isbn10": "1942788819",
    "isbn13": "9781942788812",
    "googleBooks": {
      "id": "oFdRuAEACAAJ",
      "preview": "http://books.google.com/books?id=oFdRuAEACAAJ&dq=intitle:Team+Topologies:+Organizing+Business+and+Technology+Teams+for+Fast+Flow+by+Matthew+Skelton+and+Manuel+Pais&hl=&cd=1&source=gbs_api",
      "info": "http://books.google.com/books?id=oFdRuAEACAAJ&dq=intitle:Team+Topologies:+Organizing+Business+and+Technology+Teams+for+Fast+Flow+by+Matthew+Skelton+and+Manuel+Pais&hl=&source=gbs_api",
      "canonical": "https://books.google.com/books/about/Team_Topologies.html?hl=&id=oFdRuAEACAAJ"
    },
    "issueNumber": 43,
    "progressPercent": 0,
    "state": "want-to-read",
    "startedAt": "2024-02-26T10:24:23.000Z"
  },
  {
    "title": "Accelerate",
    "authors": [
      "Nicole Forsgren PhD",
      "Jez Humble",
      "Gene Kim"
    ],
    "publisher": "IT Revolution",
    "publishedDate": "2018-03-27",
    "description": "Winner of the Shingo Publication Award Accelerate your organization to win in the marketplace. How can we apply technology to drive business value? For years, we've been told that the performance of software delivery teams doesn't matter―that it can't provide a competitive advantage to our companies. Through four years of groundbreaking research to include data collected from the State of DevOps reports conducted with Puppet, Dr. Nicole Forsgren, Jez Humble, and Gene Kim set out to find a way to measure software delivery performance―and what drives it―using rigorous statistical methods. This book presents both the findings and the science behind that research, making the information accessible for readers to apply in their own organizations. Readers will discover how to measure the performance of their teams, and what capabilities they should invest in to drive higher performance. This book is ideal for management at every level.",
    "image": "http://books.google.com/books/content?id=Kax-DwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
    "language": "en",
    "averageRating": 5,
    "ratingsCount": 1,
    "categories": [
      "Business & Economics"
    ],
    "pageCount": 288,
    "isbn10": "1942788355",
    "isbn13": "9781942788355",
    "googleBooks": {
      "id": "Kax-DwAAQBAJ",
      "preview": "http://books.google.com/books?id=Kax-DwAAQBAJ&printsec=frontcover&dq=intitle:Accelerate:+The+Science+of+Lean+Software+and+DevOps:+Building+and+Scaling+High+Performing+Technology+Organizations&hl=&cd=1&source=gbs_api",
      "info": "https://play.google.com/store/books/details?id=Kax-DwAAQBAJ&source=gbs_api",
      "canonical": "https://play.google.com/store/books/details?id=Kax-DwAAQBAJ"
    },
    "issueNumber": 42,
    "progressPercent": 0,
    "state": "completed",
    "startedAt": "2024-01-31T03:52:33.000Z",
    "completedAt": "2024-06-23T11:23:33.000Z",
    "timeToComplete": 12468660000,
    "timeToCompleteFormatted": "4 months"
  },
  {
    "title": "The Missing README",
    "authors": [
      "Chris Riccomini",
      "Dmitriy Ryaboy"
    ],
    "publisher": "No Starch Press",
    "publishedDate": "2021-08-10",
    "description": "Key concepts and best practices for new software engineers — stuff critical to your workplace success that you weren’t taught in school. For new software engineers, knowing how to program is only half the battle. You’ll quickly find that many of the skills and processes key to your success are not taught in any school or bootcamp. The Missing README fills in that gap—a distillation of workplace lessons, best practices, and engineering fundamentals that the authors have taught rookie developers at top companies for more than a decade. Early chapters explain what to expect when you begin your career at a company. The book’s middle section expands your technical education, teaching you how to work with existing codebases, address and prevent technical debt, write production-grade software, manage dependencies, test effectively, do code reviews, safely deploy software, design evolvable architectures, and handle incidents when you’re on-call. Additional chapters cover planning and interpersonal skills such as Agile planning, working effectively with your manager, and growing to senior levels and beyond. You’ll learn: How to use the legacy code change algorithm, and leave code cleaner than you found it How to write operable code with logging, metrics, configuration, and defensive programming How to write deterministic tests, submit code reviews, and give feedback on other people’s code The technical design process, including experiments, problem definition, documentation, and collaboration What to do when you are on-call, and how to navigate production incidents Architectural techniques that make code change easier Agile development practices like sprint planning, stand-ups, and retrospectives This is the book your tech lead wishes every new engineer would read before they start. By the end, you’ll know what it takes to transition into the workplace–from CS classes or bootcamps to professional software engineering.",
    "image": "http://books.google.com/books/content?id=M7UjEAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
    "language": "en",
    "categories": [
      "Computers"
    ],
    "pageCount": 194,
    "isbn10": "1718501846",
    "isbn13": "9781718501843",
    "googleBooks": {
      "id": "M7UjEAAAQBAJ",
      "preview": "http://books.google.com/books?id=M7UjEAAAQBAJ&printsec=frontcover&dq=intitle:The+Software+Engineer%27s+Guidebook&hl=&cd=1&source=gbs_api",
      "info": "https://play.google.com/store/books/details?id=M7UjEAAAQBAJ&source=gbs_api",
      "canonical": "https://play.google.com/store/books/details?id=M7UjEAAAQBAJ"
    },
    "issueNumber": 39,
    "progressPercent": 0,
    "state": "want-to-read",
    "startedAt": "2023-11-19T22:26:14.000Z"
  },
  {
    "title": "Engineering Management for the Rest of Us",
    "authors": [
      "Sarah Drasner"
    ],
    "publishedDate": "2022-11",
    "description": "A lot of Engineering Managers and leaders studied for years and years to become the best Engineer they possibly could be... and then they were promoted. It can be very tough for those of us who didn't go into Engineering with the distinct concept that we would become managers, but still want to do our best to support our teams. I wrote this book because there's so much no one told me about management that I wished I would have known. There's a lot to be purposeful about that many of us learn on the job, and worse: learn on people. This book provides some organization for collaborating with networks of people, working together towards a common purpose. There seem to be millions of articles and \"how to\"s on programming and only a handful of resources on Engineering Management- why? It's very tough to talk about something that involves people processes. People are non-deterministic. Working relationships are nuanced, communication is linked with individual values, motivations, power dynamics, and skills. People also have a range of experiences and emotions that are not consistent day-to-day. Hopefully, in the happiest, most productive sense. It's imperative that we as managers learn as much as we can and work on ourselves, so that our teams may enjoy a healthy working life and strong relationships. It's not just important, it's crucial that we iterate on our own skills as managers so that we can properly support everyone around us: individuals, peers, leadership, and the business. I'm sharing what I've learned- not so that you follow my concepts exactly, but rather so that you can be thoughtful about your own leadership and needs. The book goes from the macro to the micro- with topics ranging everywhere from \"feedback\" to \"scoping down PRs\". Though the book is meant to address people in management, individual contributors are welcome to read the book as well- perhaps you need to manage up and need some tools to help guide the conversation, perhaps you just want a peek at other concerns within the business- everyone is invited to the conversation.",
    "image": "http://books.google.com/books/content?id=sK9RzwEACAAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api",
    "language": "en",
    "pageCount": 0,
    "isbn13": "9798986769301",
    "googleBooks": {
      "id": "sK9RzwEACAAJ",
      "preview": "http://books.google.com/books?id=sK9RzwEACAAJ&dq=intitle:Engineering+Management+for+the+Rest+of+Us&hl=&cd=1&source=gbs_api",
      "info": "http://books.google.com/books?id=sK9RzwEACAAJ&dq=intitle:Engineering+Management+for+the+Rest+of+Us&hl=&source=gbs_api",
      "canonical": "https://books.google.com/books/about/Engineering_Management_for_the_Rest_of_U.html?hl=&id=sK9RzwEACAAJ"
    },
    "issueNumber": 37,
    "progressPercent": 0,
    "state": "want-to-read",
    "startedAt": "2023-11-19T22:24:06.000Z"
  },
  {
    "title": "Command and Control",
    "authors": [
      "Eric Schlosser"
    ],
    "publisher": "Penguin",
    "publishedDate": "2014-08-26",
    "description": "The Oscar-shortlisted documentary Command and Control, directed by Robert Kenner, finds its origins in Eric Schlosser's book and continues to explore the little-known history of the management and safety concerns of America's nuclear aresenal. “A devastatingly lucid and detailed new history of nuclear weapons in the U.S. Fascinating.” —Lev Grossman, TIME Magazine “Perilous and gripping . . . Schlosser skillfully weaves together an engrossing account of both the science and the politics of nuclear weapons safety.” —San Francisco Chronicle A myth-shattering exposé of America’s nuclear weapons Famed investigative journalist Eric Schlosser digs deep to uncover secrets about the management of America’s nuclear arsenal. A groundbreaking account of accidents, near misses, extraordinary heroism, and technological breakthroughs, Command and Control explores the dilemma that has existed since the dawn of the nuclear age: How do you deploy weapons of mass destruction without being destroyed by them? That question has never been resolved—and Schlosser reveals how the combination of human fallibility and technological complexity still poses a grave risk to mankind. While the harms of global warming increasingly dominate the news, the equally dangerous yet more immediate threat of nuclear weapons has been largely forgotten. Written with the vibrancy of a first-rate thriller, Command and Control interweaves the minute-by-minute story of an accident at a nuclear missile silo in rural Arkansas with a historical narrative that spans more than fifty years. It depicts the urgent effort by American scientists, policy makers, and military officers to ensure that nuclear weapons can’t be stolen, sabotaged, used without permission, or detonated inadvertently. Schlosser also looks at the Cold War from a new perspective, offering history from the ground up, telling the stories of bomber pilots, missile commanders, maintenance crews, and other ordinary servicemen who risked their lives to avert a nuclear holocaust. At the heart of the book lies the struggle, amid the rolling hills and small farms of Damascus, Arkansas, to prevent the explosion of a ballistic missile carrying the most powerful nuclear warhead ever built by the United States. Drawing on recently declassified documents and interviews with people who designed and routinely handled nuclear weapons, Command and Control takes readers into a terrifying but fascinating world that, until now, has been largely hidden from view. Through the details of a single accident, Schlosser illustrates how an unlikely event can become unavoidable, how small risks can have terrible consequences, and how the most brilliant minds in the nation can only provide us with an illusion of control. Audacious, gripping, and unforgettable, Command and Control is a tour de force of investigative journalism, an eye-opening look at the dangers of America’s nuclear age.",
    "image": "http://books.google.com/books/content?id=lJ6JDQAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
    "language": "en",
    "averageRating": 4,
    "ratingsCount": 21,
    "categories": [
      "History"
    ],
    "pageCount": 658,
    "isbn10": "0143125788",
    "isbn13": "9780143125785",
    "googleBooks": {
      "id": "lJ6JDQAAQBAJ",
      "preview": "http://books.google.com/books?id=lJ6JDQAAQBAJ&printsec=frontcover&dq=intitle:Command+and+Control&hl=&cd=1&source=gbs_api",
      "info": "http://books.google.com/books?id=lJ6JDQAAQBAJ&dq=intitle:Command+and+Control&hl=&source=gbs_api",
      "canonical": "https://books.google.com/books/about/Command_and_Control.html?hl=&id=lJ6JDQAAQBAJ"
    },
    "issueNumber": 36,
    "progressPercent": 0,
    "state": "want-to-read",
    "startedAt": "2023-09-18T11:23:49.000Z"
  },
  {
    "title": "EMPOWERED",
    "authors": [
      "Marty Cagan"
    ],
    "publisher": "John Wiley & Sons",
    "publishedDate": "2020-12-03",
    "description": "What is it about the top tech product companies such as Amazon, Apple, Google, Netflix and Tesla that enables their record of consistent innovation? Most people think it’s because these companies are somehow able to find and attract a level of talent that makes this innovation possible. But the real advantage these companies have is not so much who they hire, but rather how they enable their people to work together to solve hard problems and create extraordinary products. As legendary Silicon Valley coach--and coach to the founders of several of today’s leading tech companies--Bill Campbell said, “Leadership is about recognizing that there's a greatness in everyone, and your job is to create an environment where that greatness can emerge.” The goal of EMPOWERED is to provide you, as a leader of product management, product design, or engineering, with everything you’ll need to create just such an environment. As partners at The Silicon Valley Product Group, Marty Cagan and Chris Jones have long worked to reveal the best practices of the most consistently innovative companies in the world. A natural companion to the bestseller INSPIRED, EMPOWERED tackles head-on the reason why most companies fail to truly leverage the potential of their people to innovate: product leadership. The book covers: what it means to be an empowered product team, and how this is different from the “feature teams” used by most companies to build technology products recruiting and coaching the members of product teams, first to competence, and then to reach their potential creating an inspiring product vision along with an insights-driven product strategy translating that strategy into action by empowering teams with specific objectives—problems to solve—rather than features to build redefining the relationship of the product teams to the rest of the company detailing the changes necessary to effectively and successfully transform your organization to truly empowered product teams EMPOWERED puts decades of lessons learned from the best leaders of the top technology companies in your hand as a guide. It shows you how to become the leader your team and company needs to not only survive but thrive.",
    "image": "http://books.google.com/books/content?id=e1UFEAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
    "language": "en",
    "averageRating": 3,
    "ratingsCount": 1,
    "categories": [
      "Business & Economics"
    ],
    "pageCount": 432,
    "isbn10": "111969129X",
    "isbn13": "9781119691297",
    "googleBooks": {
      "id": "e1UFEAAAQBAJ",
      "preview": "http://books.google.com/books?id=e1UFEAAAQBAJ&printsec=frontcover&dq=intitle:Empowered:++Ordinary+People,+Extraordinary+Products&hl=&cd=1&source=gbs_api",
      "info": "http://books.google.com/books?id=e1UFEAAAQBAJ&dq=intitle:Empowered:++Ordinary+People,+Extraordinary+Products&hl=&source=gbs_api",
      "canonical": "https://books.google.com/books/about/EMPOWERED.html?hl=&id=e1UFEAAAQBAJ"
    },
    "issueNumber": 35,
    "progressPercent": 0,
    "state": "want-to-read",
    "startedAt": "2023-08-29T22:28:48.000Z"
  },
  {
    "title": "Clean Architecture",
    "authors": [
      "Robert C. Martin"
    ],
    "publisher": "Prentice Hall",
    "publishedDate": "2017-09-12",
    "description": "Practical Software Architecture Solutions from the Legendary Robert C. Martin (“Uncle Bob”) By applying universal rules of software architecture, you can dramatically improve developer productivity throughout the life of any software system. Now, building upon the success of his best-selling books Clean Code and The Clean Coder, legendary software craftsman Robert C. Martin (“Uncle Bob”) reveals those rules and helps you apply them. Martin’s Clean Architecture doesn’t merely present options. Drawing on over a half-century of experience in software environments of every imaginable type, Martin tells you what choices to make and why they are critical to your success. As you’ve come to expect from Uncle Bob, this book is packed with direct, no-nonsense solutions for the real challenges you’ll face–the ones that will make or break your projects. Learn what software architects need to achieve–and core disciplines and practices for achieving it Master essential software design principles for addressing function, component separation, and data management See how programming paradigms impose discipline by restricting what developers can do Understand what’s critically important and what’s merely a “detail” Implement optimal, high-level structures for web, database, thick-client, console, and embedded applications Define appropriate boundaries and layers, and organize components and services See why designs and architectures go wrong, and how to prevent (or fix) these failures Clean Architecture is essential reading for every current or aspiring software architect, systems analyst, system designer, and software manager–and for every programmer who must execute someone else’s designs. Register your product for convenient access to downloads, updates, and/or corrections as they become available.",
    "image": "http://books.google.com/books/content?id=uGE1DwAAQBAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api",
    "language": "en",
    "averageRating": 2.5,
    "ratingsCount": 3,
    "categories": [
      "Computers"
    ],
    "pageCount": 651,
    "isbn10": "0134494326",
    "isbn13": "9780134494326",
    "googleBooks": {
      "id": "uGE1DwAAQBAJ",
      "preview": "http://books.google.com/books?id=uGE1DwAAQBAJ&q=intitle:Clean+Architecture&dq=intitle:Clean+Architecture&hl=&cd=1&source=gbs_api",
      "info": "https://play.google.com/store/books/details?id=uGE1DwAAQBAJ&source=gbs_api",
      "canonical": "https://play.google.com/store/books/details?id=uGE1DwAAQBAJ"
    },
    "issueNumber": 33,
    "progressPercent": 0,
    "state": "want-to-read",
    "startedAt": "2023-08-29T22:27:56.000Z"
  },
  {
    "title": "An Elegant Puzzle",
    "authors": [
      "Will Larson"
    ],
    "publisher": "Stripe Press",
    "publishedDate": "2019-05-20",
    "description": "A human-centric guide to solving complex problems in engineering management, from sizing teams to handling technical debt. There's a saying that people don't leave companies, they leave managers. Management is a key part of any organization, yet the discipline is often self-taught and unstructured. Getting to the good solutions for complex management challenges can make the difference between fulfillment and frustration for teams--and, ultimately, between the success and failure of companies. Will Larson's An Elegant Puzzle focuses on the particular challenges of engineering management--from sizing teams to handling technical debt to performing succession planning--and provides a path to the good solutions. Drawing from his experience at Digg, Uber, and Stripe, Larson has developed a thoughtful approach to engineering management for leaders of all levels at companies of all sizes. An Elegant Puzzle balances structured principles and human-centric thinking to help any leader create more effective and rewarding organizations for engineers to thrive in.",
    "image": "http://books.google.com/books/content?id=2ZQrxQEACAAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api",
    "language": "en",
    "categories": [
      "Business ethics"
    ],
    "pageCount": 0,
    "isbn10": "1732265186",
    "isbn13": "9781732265189",
    "googleBooks": {
      "id": "2ZQrxQEACAAJ",
      "preview": "http://books.google.com/books?id=2ZQrxQEACAAJ&dq=intitle:An+Elegant+Puzzle:+Systems+of+Engineering+Management&hl=&cd=1&source=gbs_api",
      "info": "http://books.google.com/books?id=2ZQrxQEACAAJ&dq=intitle:An+Elegant+Puzzle:+Systems+of+Engineering+Management&hl=&source=gbs_api",
      "canonical": "https://books.google.com/books/about/An_Elegant_Puzzle.html?hl=&id=2ZQrxQEACAAJ"
    },
    "issueNumber": 27,
    "progressPercent": 0,
    "state": "completed",
    "startedAt": "2023-08-29T22:24:26.000Z",
    "completedAt": "2023-11-08T20:44:52.000Z",
    "timeToComplete": 6128426000,
    "timeToCompleteFormatted": "2 months"
  },
  {
    "title": "Patterns of Enterprise Application Architecture",
    "authors": [
      "Martin Fowler"
    ],
    "publisher": "Addison-Wesley",
    "publishedDate": "2012-03-09",
    "description": "The practice of enterprise application development has benefited from the emergence of many new enabling technologies. Multi-tiered object-oriented platforms, such as Java and .NET, have become commonplace. These new tools and technologies are capable of building powerful applications, but they are not easily implemented. Common failures in enterprise applications often occur because their developers do not understand the architectural lessons that experienced object developers have learned. Patterns of Enterprise Application Architecture is written in direct response to the stiff challenges that face enterprise application developers. The author, noted object-oriented designer Martin Fowler, noticed that despite changes in technology--from Smalltalk to CORBA to Java to .NET--the same basic design ideas can be adapted and applied to solve common problems. With the help of an expert group of contributors, Martin distills over forty recurring solutions into patterns. The result is an indispensable handbook of solutions that are applicable to any enterprise application platform. This book is actually two books in one. The first section is a short tutorial on developing enterprise applications, which you can read from start to finish to understand the scope of the book's lessons. The next section, the bulk of the book, is a detailed reference to the patterns themselves. Each pattern provides usage and implementation information, as well as detailed code examples in Java or C#. The entire book is also richly illustrated with UML diagrams to further explain the concepts. Armed with this book, you will have the knowledge necessary to make important architectural decisions about building an enterprise application and the proven patterns for use when building them. The topics covered include · Dividing an enterprise application into layers · The major approaches to organizing business logic · An in-depth treatment of mapping between objects and relational databases · Using Model-View-Controller to organize a Web presentation · Handling concurrency for data that spans multiple transactions · Designing distributed object interfaces",
    "image": "http://books.google.com/books/content?id=vqTfNFDzzdIC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
    "language": "en",
    "averageRating": 3.5,
    "ratingsCount": 10,
    "categories": [
      "Computers"
    ],
    "pageCount": 558,
    "isbn10": "0133065219",
    "isbn13": "9780133065213",
    "googleBooks": {
      "id": "vqTfNFDzzdIC",
      "preview": "http://books.google.com/books?id=vqTfNFDzzdIC&printsec=frontcover&dq=intitle:Patterns+of+Enterprise+Application+Architecture&hl=&cd=1&source=gbs_api",
      "info": "https://play.google.com/store/books/details?id=vqTfNFDzzdIC&source=gbs_api",
      "canonical": "https://play.google.com/store/books/details?id=vqTfNFDzzdIC"
    },
    "issueNumber": 24,
    "progressPercent": 0,
    "state": "want-to-read",
    "startedAt": "2023-08-29T22:19:48.000Z"
  },
  {
    "title": "Age of Anger",
    "authors": [
      "Pankaj Mishra"
    ],
    "publisher": "Macmillan",
    "publishedDate": "2017-02-07",
    "description": "A New York Times Notable Book of 2017 • Named a Best Book of the Year by Slate and NPR • Longlisted for the Orwell Prize One of our most important public intellectuals reveals the hidden history of our current global crisis How can we explain the origins of the great wave of paranoid hatreds that seem inescapable in our close-knit world—from American shooters and ISIS to Donald Trump, from a rise in vengeful nationalism across the world to racism and misogyny on social media? In Age of Anger, Pankaj Mishra answers our bewilderment by casting his gaze back to the eighteenth century before leading us to the present. He shows that as the world became modern, those who were unable to enjoy its promises—of freedom, stability, and prosperity—were increasingly susceptible to demagogues. The many who came late to this new world—or were left, or pushed, behind—reacted in horrifyingly similar ways: with intense hatred of invented enemies, attempts to re-create an imaginary golden age, and self-empowerment through spectacular violence. It was from among the ranks of the disaffected that the militants of the nineteenth century arose—angry young men who became cultural nationalists in Germany, messianic revolutionaries in Russia, bellicose chauvinists in Italy, and anarchist terrorists internationally. Today, just as then, the wide embrace of mass politics and technology and the pursuit of wealth and individualism have cast many more billions adrift in a demoralized world, uprooted from tradition but still far from modernity—with the same terrible results. Making startling connections and comparisons, Age of Anger is a book of immense urgency and profound argument. It is a history of our present predicament unlike any other.",
    "image": "http://books.google.com/books/content?id=qejZDQAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
    "language": "en",
    "averageRating": 3,
    "ratingsCount": 4,
    "categories": [
      "HISTORY"
    ],
    "pageCount": 417,
    "isbn10": "0374274789",
    "isbn13": "9780374274788",
    "googleBooks": {
      "id": "qejZDQAAQBAJ",
      "preview": "http://books.google.com/books?id=qejZDQAAQBAJ&printsec=frontcover&dq=intitle:Age+of+Anger+by+Pankaj+Mishra&hl=&cd=1&source=gbs_api",
      "info": "http://books.google.com/books?id=qejZDQAAQBAJ&dq=intitle:Age+of+Anger+by+Pankaj+Mishra&hl=&source=gbs_api",
      "canonical": "https://books.google.com/books/about/Age_of_Anger.html?hl=&id=qejZDQAAQBAJ"
    },
    "issueNumber": 6,
    "progressPercent": 0,
    "state": "want-to-read",
    "startedAt": "2023-01-11T10:56:12.000Z"
  },
  {
    "title": "Tropic of Cancer",
    "authors": [
      "Henry Miller"
    ],
    "publisher": "Miller, Henry",
    "publishedDate": "1961",
    "description": "The account of a young writer and his friends in free-wheeling Paris.",
    "image": "http://books.google.com/books/content?id=G54FAQAAIAAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api",
    "language": "en",
    "averageRating": 3,
    "ratingsCount": 45,
    "categories": [
      "Fiction"
    ],
    "pageCount": 360,
    "googleBooks": {
      "id": "G54FAQAAIAAJ",
      "preview": "http://books.google.com/books?id=G54FAQAAIAAJ&q=intitle:Tropic+of+Cancer+by+Henry+Miller&dq=intitle:Tropic+of+Cancer+by+Henry+Miller&hl=&cd=1&source=gbs_api",
      "info": "http://books.google.com/books?id=G54FAQAAIAAJ&dq=intitle:Tropic+of+Cancer+by+Henry+Miller&hl=&source=gbs_api",
      "canonical": "https://books.google.com/books/about/Tropic_of_Cancer.html?hl=&id=G54FAQAAIAAJ"
    },
    "issueNumber": 5,
    "progressPercent": 0,
    "state": "want-to-read",
    "startedAt": "2023-01-11T10:53:59.000Z"
  },
  {
    "title": "Austerity",
    "authors": [
      "Mark Blyth"
    ],
    "publisher": "Oxford University Press",
    "publishedDate": "2015",
    "description": "Selected as a Financial Times Best Book of 2013 Governments today in both Europe and the United States have succeeded in casting government spending as reckless wastefulness that has made the economy worse. In contrast, they have advanced a policy of draconian budget cuts--austerity--to solve the financial crisis. We are told that we have all lived beyond our means and now need to tighten our belts. This view conveniently forgets where all that debt came from. Not from an orgy of government spending, but as the direct result of bailing out, recapitalizing, and adding liquidity to the broken banking system. Through these actions private debt was rechristened as government debt while those responsible for generating it walked away scot free, placing the blame on the state, and the burden on the taxpayer. That burden now takes the form of a global turn to austerity, the policy of reducing domestic wages and prices to restore competitiveness and balance the budget. The problem, according to political economist Mark Blyth, is that austerity is a very dangerous idea. First of all, it doesn't work. As the past four years and countless historical examples from the last 100 years show, while it makes sense for any one state to try and cut its way to growth, it simply cannot work when all states try it simultaneously: all we do is shrink the economy. In the worst case, austerity policies worsened the Great Depression and created the conditions for seizures of power by the forces responsible for the Second World War: the Nazis and the Japanese military establishment. As Blyth amply demonstrates, the arguments for austerity are tenuous and the evidence thin. Rather than expanding growth and opportunity, the repeated revival of this dead economic idea has almost always led to low growth along with increases in wealth and income inequality. Austerity demolishes the conventional wisdom, marshaling an army of facts to demand that we austerity for what it is, and what it costs us.",
    "image": "http://books.google.com/books/content?id=H_8TDAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
    "language": "en",
    "averageRating": 3.5,
    "ratingsCount": 13,
    "categories": [
      "Business & Economics"
    ],
    "pageCount": 305,
    "isbn10": "0199389446",
    "isbn13": "9780199389445",
    "googleBooks": {
      "id": "H_8TDAAAQBAJ",
      "preview": "http://books.google.com/books?id=H_8TDAAAQBAJ&printsec=frontcover&dq=intitle:Austerity:+The+History+of+a+Dangerous+Idea+by+Mark+Blyth&hl=&cd=1&source=gbs_api",
      "info": "http://books.google.com/books?id=H_8TDAAAQBAJ&dq=intitle:Austerity:+The+History+of+a+Dangerous+Idea+by+Mark+Blyth&hl=&source=gbs_api",
      "canonical": "https://books.google.com/books/about/Austerity.html?hl=&id=H_8TDAAAQBAJ"
    },
    "issueNumber": 4,
    "progressPercent": 0,
    "state": "want-to-read",
    "startedAt": "2023-01-11T10:50:50.000Z"
  },
  {
    "title": "Clean Code",
    "authors": [
      "Robert C. Martin"
    ],
    "publisher": "Pearson Education",
    "publishedDate": "2009",
    "description": "Looks at the principles and clean code, includes case studies showcasing the practices of writing clean code, and contains a list of heuristics and \"smells\" accumulated from the process of writing clean code.",
    "image": "http://books.google.com/books/content?id=hjEFCAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
    "language": "en",
    "averageRating": 4.5,
    "ratingsCount": 10,
    "categories": [
      "Computers"
    ],
    "pageCount": 464,
    "isbn10": "0132350882",
    "isbn13": "9780132350884",
    "googleBooks": {
      "id": "hjEFCAAAQBAJ",
      "preview": "http://books.google.com/books?id=hjEFCAAAQBAJ&printsec=frontcover&dq=intitle:Clean+Code+by+Robert+Martin&hl=&cd=2&source=gbs_api",
      "info": "http://books.google.com/books?id=hjEFCAAAQBAJ&dq=intitle:Clean+Code+by+Robert+Martin&hl=&source=gbs_api",
      "canonical": "https://books.google.com/books/about/Clean_Code.html?hl=&id=hjEFCAAAQBAJ"
    },
    "issueNumber": 2,
    "progressPercent": 0,
    "state": "reading",
    "startedAt": "2023-01-11T02:50:57.000Z"
  },
  {
    "title": "No-Drama Discipline",
    "authors": [
      "Daniel J. Siegel",
      "Tina Payne Bryson"
    ],
    "publisher": "Bantam",
    "publishedDate": "2016-07-12",
    "description": "NEW YORK TIMES BESTSELLER • The pioneering experts behind The Whole-Brain Child and The Yes Brain tackle the ultimate parenting challenge: discipline. “A lot of fascinating insights . . . an eye-opener worth reading.”—Parents Highlighting the fascinating link between a child’s neurological development and the way a parent reacts to misbehavior, No-Drama Discipline provides an effective, compassionate road map for dealing with tantrums, tensions, and tears—without causing a scene. Defining the true meaning of the “d” word (to instruct, not to shout or reprimand), the authors explain how to reach your child, redirect emotions, and turn a meltdown into an opportunity for growth. By doing so, the cycle of negative behavior (and punishment) is essentially brought to a halt, as problem solving becomes a win/win situation. Inside this sanity-saving guide you’ll discover • strategies that help parents identify their own discipline philosophy—and master the best methods to communicate the lessons they are trying to impart • facts on child brain development—and what kind of discipline is most appropriate and constructive at all ages and stages • the way to calmly and lovingly connect with a child—no matter how extreme the behavior—while still setting clear and consistent limits • tips for navigating your child through a tantrum to achieve insight, empathy, and repair • twenty discipline mistakes even the best parents make—and how to stay focused on the principles of whole-brain parenting and discipline techniques Complete with candid stories and playful illustrations that bring the authors’ suggestions to life, No-Drama Discipline shows you how to work with your child’s developing mind, peacefully resolve conflicts, and inspire happiness and strengthen resilience in everyone in the family. Praise for No-Drama Discipline “With lucid, engaging prose accompanied by cartoon illustrations, Siegel and Bryson help parents teach and communicate more effectively.”—Publishers Weekly “Wow! This book grabbed me from the very first page and did not let go.”—Lawrence J. Cohen, Ph.D., author of The Opposite of Worry",
    "image": "http://books.google.com/books/content?id=8n1cDAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
    "language": "en",
    "averageRating": 3,
    "ratingsCount": 1,
    "categories": [
      "Family & Relationships"
    ],
    "pageCount": 290,
    "isbn10": "034554806X",
    "isbn13": "9780345548061",
    "googleBooks": {
      "id": "8n1cDAAAQBAJ",
      "preview": "http://books.google.com/books?id=8n1cDAAAQBAJ&printsec=frontcover&dq=intitle:The+Whole-Brain+Child&hl=&cd=8&source=gbs_api",
      "info": "http://books.google.com/books?id=8n1cDAAAQBAJ&dq=intitle:The+Whole-Brain+Child&hl=&source=gbs_api",
      "canonical": "https://books.google.com/books/about/No_Drama_Discipline.html?hl=&id=8n1cDAAAQBAJ"
    },
    "issueNumber": 40,
    "progressPercent": 0,
    "state": "completed",
    "startedAt": "2022-02-20T00:00:00.000Z",
    "completedAt": "2022-02-24T00:00:00.000Z",
    "timeToComplete": 345600000,
    "timeToCompleteFormatted": "4 days"
  },
  {
    "title": "Domain-driven Design",
    "authors": [
      "Eric Evans",
      "Eric J. Evans"
    ],
    "publisher": "Addison-Wesley Professional",
    "publishedDate": "2004",
    "description": "Describes ways to incorporate domain modeling into software development.",
    "image": "http://books.google.com/books/content?id=xColAAPGubgC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
    "language": "en",
    "averageRating": 4.5,
    "ratingsCount": 6,
    "categories": [
      "Computers"
    ],
    "pageCount": 563,
    "isbn10": "0321125215",
    "isbn13": "9780321125217",
    "googleBooks": {
      "id": "xColAAPGubgC",
      "preview": "http://books.google.com/books?id=xColAAPGubgC&printsec=frontcover&dq=intitle:Domain-driven+Design+by+Eric+Evans&hl=&cd=1&source=gbs_api",
      "info": "http://books.google.com/books?id=xColAAPGubgC&dq=intitle:Domain-driven+Design+by+Eric+Evans&hl=&source=gbs_api",
      "canonical": "https://books.google.com/books/about/Domain_driven_Design.html?hl=&id=xColAAPGubgC"
    },
    "issueNumber": 9,
    "progressPercent": 0,
    "state": "want-to-read",
    "startedAt": "2020-09-10T00:00:00.000Z"
  },
  {
    "title": "The Age of Surveillance Capitalism",
    "authors": [
      "Shoshana Zuboff"
    ],
    "publisher": "PublicAffairs",
    "publishedDate": "2019-01-15",
    "description": "The challenges to humanity posed by the digital future, the first detailed examination of the unprecedented form of power called \"surveillance capitalism,\" and the quest by powerful corporations to predict and control our behavior. In this masterwork of original thinking and research, Shoshana Zuboff provides startling insights into the phenomenon that she has named surveillance capitalism. The stakes could not be higher: a global architecture of behavior modification threatens human nature in the twenty-first century just as industrial capitalism disfigured the natural world in the twentieth. Zuboff vividly brings to life the consequences as surveillance capitalism advances from Silicon Valley into every economic sector. Vast wealth and power are accumulated in ominous new \"behavioral futures markets,\" where predictions about our behavior are bought and sold, and the production of goods and services is subordinated to a new \"means of behavioral modification.\" The threat has shifted from a totalitarian Big Brother state to a ubiquitous digital architecture: a \"Big Other\" operating in the interests of surveillance capital. Here is the crucible of an unprecedented form of power marked by extreme concentrations of knowledge and free from democratic oversight. Zuboff's comprehensive and moving analysis lays bare the threats to twenty-first century society: a controlled \"hive\" of total connection that seduces with promises of total certainty for maximum profit -- at the expense of democracy, freedom, and our human future. With little resistance from law or society, surveillance capitalism is on the verge of dominating the social order and shaping the digital future -- if we let it.",
    "image": "http://books.google.com/books/content?id=lRqrDQAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
    "language": "en",
    "averageRating": 5,
    "ratingsCount": 1,
    "categories": [
      "Business & Economics"
    ],
    "pageCount": 704,
    "isbn10": "1610395700",
    "isbn13": "9781610395700",
    "googleBooks": {
      "id": "lRqrDQAAQBAJ",
      "preview": "http://books.google.com/books?id=lRqrDQAAQBAJ&printsec=frontcover&dq=intitle:The+Age+of+Surveillance+Capitalism+by+Shoshana+Zuboff&hl=&cd=1&source=gbs_api",
      "info": "https://play.google.com/store/books/details?id=lRqrDQAAQBAJ&source=gbs_api",
      "canonical": "https://play.google.com/store/books/details?id=lRqrDQAAQBAJ"
    },
    "issueNumber": 11,
    "progressPercent": 0,
    "state": "want-to-read",
    "startedAt": "2020-02-21T00:00:00.000Z"
  },
  {
    "title": "Farmers Or Hunter-Gatherers?",
    "authors": [
      "Peter Sutton",
      "Keryn Walshe"
    ],
    "publishedDate": "2021-06-16",
    "description": "\"An authoritative study of pre-colonial Australia that dismantles and reframes popular narratives of First Nations land management and food production. Australians' understanding of Aboriginal society prior to the British invasion from 1788 has been transformed since the publication of Bruce Pascoe's Dark Emu in 2014. It argued that classical Aboriginal society was more sophisticated than Australians had been led to believe because it resembled more closely the farming communities of Europe. In Farmers or Hunter-gatherers? Peter Sutton and Keryn Walshe ask why Australians have been so receptive to the notion that farming represents an advance from hunting and gathering. Drawing on the knowledge of Aboriginal elders, previously not included within this discussion, and decades of anthropological scholarship, Sutton and Walshe provide extensive evidence to support their argument that classical Aboriginal society was a hunter-gatherer society and as sophisticated as the traditional European farming methods. 'Farmers or Hunter-gatherers?' asks Australians to develop a deeper understanding and appreciation of Aboriginal society and culture\"--Publisher's description.",
    "image": "http://books.google.com/books/content?id=j7UnzgEACAAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api",
    "language": "en",
    "categories": [
      "Aboriginal Australians"
    ],
    "pageCount": 264,
    "isbn10": "0522877850",
    "isbn13": "9780522877854",
    "googleBooks": {
      "id": "j7UnzgEACAAJ",
      "preview": "http://books.google.com/books?id=j7UnzgEACAAJ&dq=intitle:Farmers+or+Hunter-gatherers%3F+The+Dark+Emu+debate&hl=&cd=1&source=gbs_api",
      "info": "http://books.google.com/books?id=j7UnzgEACAAJ&dq=intitle:Farmers+or+Hunter-gatherers%3F+The+Dark+Emu+debate&hl=&source=gbs_api",
      "canonical": "https://books.google.com/books/about/Farmers_Or_Hunter_Gatherers.html?hl=&id=j7UnzgEACAAJ"
    },
    "issueNumber": 12,
    "progressPercent": 0,
    "state": "want-to-read",
    "startedAt": "2019-11-13T00:00:00.000Z"
  },
  {
    "title": "Test-driven Development",
    "authors": [
      "Kent Beck"
    ],
    "publisher": "Addison-Wesley Professional",
    "publishedDate": "2003",
    "description": "About software development through constant testing.",
    "image": "http://books.google.com/books/content?id=CUlsAQAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
    "language": "en",
    "averageRating": 4,
    "ratingsCount": 3,
    "categories": [
      "Computers"
    ],
    "pageCount": 241,
    "isbn10": "0321146530",
    "isbn13": "9780321146533",
    "googleBooks": {
      "id": "CUlsAQAAQBAJ",
      "preview": "http://books.google.com/books?id=CUlsAQAAQBAJ&printsec=frontcover&dq=intitle:Test+Driven+Development+:+By+Example&hl=&cd=1&source=gbs_api",
      "info": "http://books.google.com/books?id=CUlsAQAAQBAJ&dq=intitle:Test+Driven+Development+:+By+Example&hl=&source=gbs_api",
      "canonical": "https://books.google.com/books/about/Test_driven_Development.html?hl=&id=CUlsAQAAQBAJ"
    },
    "issueNumber": 23,
    "progressPercent": 0,
    "state": "want-to-read",
    "startedAt": "2019-06-01T00:00:00.000Z"
  },
  {
    "title": "Dark Emu",
    "authors": [
      "Bruce Pascoe"
    ],
    "publishedDate": "2018",
    "description": "Dark Emu argues for a reconsideration of the 'hunter-gatherer' tag for pre-colonial Aboriginal Australians and attempts to rebut the colonial myths that have worked to justify dispossession. Accomplished author Bruce Pascoe provides compelling evidence from the diaries of early explorers that suggests that systems of food production and land management have been blatantly understated in modern retellings of early Aboriginal history, and that a new look at Australia's past is required.",
    "image": "https://tse2.mm.bing.net/th?q=Dark%20Emu%20by%20Bruce%20Pascoe&w=256&c=7&rs=1&p=0&dpr=3&pid=1.7&mkt=en-IN&adlt=moderate",
    "language": "en",
    "averageRating": 4,
    "ratingsCount": 8,
    "categories": [
      "Aboriginal Australians"
    ],
    "pageCount": 309,
    "isbn10": "0369332873",
    "isbn13": "9780369332875",
    "googleBooks": {
      "id": "spWjzQEACAAJ",
      "preview": "http://books.google.com/books?id=spWjzQEACAAJ&dq=intitle:Dark+Emu+by+Bruce+Pascoe&hl=&cd=3&source=gbs_api",
      "info": "http://books.google.com/books?id=spWjzQEACAAJ&dq=intitle:Dark+Emu+by+Bruce+Pascoe&hl=&source=gbs_api",
      "canonical": "https://books.google.com/books/about/Dark_Emu.html?hl=&id=spWjzQEACAAJ"
    },
    "issueNumber": 13,
    "progressPercent": 0,
    "state": "completed",
    "startedAt": "2019-03-25T00:00:00.000Z",
    "completedAt": "2020-02-22T00:00:00.000Z",
    "timeToComplete": 28857600000,
    "timeToCompleteFormatted": "10 months"
  },
  {
    "title": "Practice",
    "authors": [
      "Guy Rundle"
    ],
    "publisher": "Black Incorporated",
    "publishedDate": "2019-03-05",
    "description": "Known for his wild wit and irreverent commentary, Guy Rundle is one of Australia's most virtuosic minds. Practicedistils his best writing on politics, culture, class and more. In it, Rundle roves the campaign trails of Obama, Palin and Trump; rides the Amtrak around a desolate America; bails up Bob Katter and Pauline Hanson; and excavates the deeper meanings of True Detective and Joy Division. Insightful and hilarious, Practicereveals Rundle as among Australia's sharpest and most entertaining minds, with a genuinely awe-inducing range and an utterly inimitable voice. There is only one Guy Rundle.",
    "image": "http://books.google.com/books/content?id=VHaSvQEACAAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api",
    "language": "en",
    "categories": [
      "Political Science"
    ],
    "pageCount": 382,
    "isbn10": "1760641316",
    "isbn13": "9781760641313",
    "googleBooks": {
      "id": "VHaSvQEACAAJ",
      "preview": "http://books.google.com/books?id=VHaSvQEACAAJ&dq=intitle:Practice+by+Guy+Rundle&hl=&cd=1&source=gbs_api",
      "info": "http://books.google.com/books?id=VHaSvQEACAAJ&dq=intitle:Practice+by+Guy+Rundle&hl=&source=gbs_api",
      "canonical": "https://books.google.com/books/about/Practice.html?hl=&id=VHaSvQEACAAJ"
    },
    "issueNumber": 14,
    "progressPercent": 0,
    "state": "completed",
    "startedAt": "2019-02-06T00:00:00.000Z",
    "completedAt": "2020-02-22T00:00:00.000Z",
    "timeToComplete": 32918400000,
    "timeToCompleteFormatted": "1 year"
  },
  {
    "title": "A Brief History of Equality",
    "authors": [
      "Thomas Piketty",
      "Steven Rendall"
    ],
    "publishedDate": "2022-05-18",
    "image": "https://tse2.mm.bing.net/th?q=A%20Brief%20History%20of%20Equality%20by%20Thomas%20Piketty%2C%20Steven%20Rendall&w=256&c=7&rs=1&p=0&dpr=3&pid=1.7&mkt=en-IN&adlt=moderate",
    "language": "en",
    "averageRating": 4,
    "ratingsCount": 2,
    "pageCount": 288,
    "isbn10": "0674279085",
    "isbn13": "9780674279087",
    "googleBooks": {
      "id": "f8UVzwEACAAJ",
      "preview": "http://books.google.com/books?id=f8UVzwEACAAJ&dq=intitle:A+Brief+History+of+Equality+by+Thomas+Piketty&hl=&cd=2&source=gbs_api",
      "info": "http://books.google.com/books?id=f8UVzwEACAAJ&dq=intitle:A+Brief+History+of+Equality+by+Thomas+Piketty&hl=&source=gbs_api",
      "canonical": "https://books.google.com/books/about/A_Brief_History_of_Equality.html?hl=&id=f8UVzwEACAAJ"
    },
    "issueNumber": 15,
    "progressPercent": 0,
    "state": "want-to-read",
    "startedAt": "2019-01-01T00:00:00.000Z"
  },
  {
    "title": "The Pragmatic Programmer",
    "authors": [
      "Andrew Hunt",
      "David Thomas"
    ],
    "publisher": "Addison-Wesley Professional",
    "publishedDate": "1999-10-20",
    "description": "What others in the trenches say about The Pragmatic Programmer... “The cool thing about this book is that it’s great for keeping the programming process fresh. The book helps you to continue to grow and clearly comes from people who have been there.” — Kent Beck, author of Extreme Programming Explained: Embrace Change “I found this book to be a great mix of solid advice and wonderful analogies!” — Martin Fowler, author of Refactoring and UML Distilled “I would buy a copy, read it twice, then tell all my colleagues to run out and grab a copy. This is a book I would never loan because I would worry about it being lost.” — Kevin Ruland, Management Science, MSG-Logistics “The wisdom and practical experience of the authors is obvious. The topics presented are relevant and useful.... By far its greatest strength for me has been the outstanding analogies—tracer bullets, broken windows, and the fabulous helicopter-based explanation of the need for orthogonality, especially in a crisis situation. I have little doubt that this book will eventually become an excellent source of useful information for journeymen programmers and expert mentors alike.” — John Lakos, author of Large-Scale C++ Software Design “This is the sort of book I will buy a dozen copies of when it comes out so I can give it to my clients.” — Eric Vought, Software Engineer “Most modern books on software development fail to cover the basics of what makes a great software developer, instead spending their time on syntax or technology where in reality the greatest leverage possible for any software team is in having talented developers who really know their craft well. An excellent book.” — Pete McBreen, Independent Consultant “Since reading this book, I have implemented many of the practical suggestions and tips it contains. Across the board, they have saved my company time and money while helping me get my job done quicker! This should be a desktop reference for everyone who works with code for a living.” — Jared Richardson, Senior Software Developer, iRenaissance, Inc. “I would like to see this issued to every new employee at my company....” — Chris Cleeland, Senior Software Engineer, Object Computing, Inc. “If I’m putting together a project, it’s the authors of this book that I want. . . . And failing that I’d settle for people who’ve read their book.” — Ward Cunningham Straight from the programming trenches, The Pragmatic Programmer cuts through the increasing specialization and technicalities of modern software development to examine the core process--taking a requirement and producing working, maintainable code that delights its users. It covers topics ranging from personal responsibility and career development to architectural techniques for keeping your code flexible and easy to adapt and reuse. Read this book, and you'll learn how to Fight software rot; Avoid the trap of duplicating knowledge; Write flexible, dynamic, and adaptable code; Avoid programming by coincidence; Bullet-proof your code with contracts, assertions, and exceptions; Capture real requirements; Test ruthlessly and effectively; Delight your users; Build teams of pragmatic programmers; and Make your developments more precise with automation. Written as a series of self-contained sections and filled with entertaining anecdotes, thoughtful examples, and interesting analogies, The Pragmatic Programmer illustrates the best practices and major pitfalls of many different aspects of software development. Whether you're a new coder, an experienced programmer, or a manager responsible for software projects, use these lessons daily, and you'll quickly see improvements in personal productivity, accuracy, and job satisfaction. You'll learn skills and develop habits and attitudes that form the foundation for long-term success in your career. You'll become a Pragmatic Programmer.",
    "image": "http://books.google.com/books/content?id=5wBQEp6ruIAC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
    "language": "en",
    "averageRating": 4,
    "ratingsCount": 14,
    "categories": [
      "Computers"
    ],
    "pageCount": 346,
    "isbn10": "013211917X",
    "isbn13": "9780132119177",
    "googleBooks": {
      "id": "5wBQEp6ruIAC",
      "preview": "http://books.google.com/books?id=5wBQEp6ruIAC&pg=PA264&dq=intitle:The+Pragmatic+Programmer+2nd+edition&hl=&cd=7&source=gbs_api",
      "info": "https://play.google.com/store/books/details?id=5wBQEp6ruIAC&source=gbs_api",
      "canonical": "https://play.google.com/store/books/details?id=5wBQEp6ruIAC"
    },
    "issueNumber": 32,
    "progressPercent": 0,
    "state": "want-to-read",
    "startedAt": "2015-02-12T00:00:00.000Z"
  },
  {
    "title": "The Manager's Path",
    "authors": [
      "Camille Fournier"
    ],
    "publisher": "\"O'Reilly Media, Inc.\"",
    "publishedDate": "2017-03-13",
    "description": "Managing people is difficult wherever you work. But in the tech industry, where management is also a technical discipline, the learning curve can be brutal—especially when there are few tools, texts, and frameworks to help you. In this practical guide, author Camille Fournier (tech lead turned CTO) takes you through each stage in the journey from engineer to technical manager. From mentoring interns to working with senior staff, you’ll get actionable advice for approaching various obstacles in your path. This book is ideal whether you’re a new manager, a mentor, or a more experienced leader looking for fresh advice. Pick up this book and learn how to become a better manager and leader in your organization. Begin by exploring what you expect from a manager Understand what it takes to be a good mentor, and a good tech lead Learn how to manage individual members while remaining focused on the entire team Understand how to manage yourself and avoid common pitfalls that challenge many leaders Manage multiple teams and learn how to manage managers Learn how to build and bootstrap a unifying culture in teams",
    "image": "http://books.google.com/books/content?id=FaNaDgAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
    "language": "en",
    "averageRating": 4.5,
    "ratingsCount": 5,
    "categories": [
      "Business & Economics"
    ],
    "pageCount": 244,
    "isbn10": "1491973846",
    "isbn13": "9781491973844",
    "googleBooks": {
      "id": "FaNaDgAAQBAJ",
      "preview": "http://books.google.com/books?id=FaNaDgAAQBAJ&pg=PT1&dq=intitle:The+Manager%27s+Path:+A+Guide+for+Tech+Leaders+Navigating+Growth+and+Change&hl=&cd=2&source=gbs_api",
      "info": "https://play.google.com/store/books/details?id=FaNaDgAAQBAJ&source=gbs_api",
      "canonical": "https://play.google.com/store/books/details?id=FaNaDgAAQBAJ"
    },
    "issueNumber": 30,
    "progressPercent": 0,
    "state": "want-to-read",
    "startedAt": "2014-10-12T00:00:00.000Z"
  },
  {
    "title": "Principles of Software Engineering Management",
    "authors": [
      "Tom Gilb"
    ],
    "publisher": "Addison-Wesley Longman",
    "publishedDate": "1997-01-01",
    "description": "This book is designed to help software engineers and project managers understand and solve problems involved in developing complex software systems. It provides guidelines and tools for managing the technical and organizational aspects of software engineering projects.",
    "image": "https://tse2.mm.bing.net/th?q=Principles%20of%20Software%20Engineering%20Management%20by%20Tom%20Gilb&w=256&c=7&rs=1&p=0&dpr=3&pid=1.7&mkt=en-IN&adlt=moderate",
    "language": "en",
    "averageRating": 3,
    "ratingsCount": 2,
    "pageCount": 512,
    "isbn10": "0201427826",
    "isbn13": "9780201427820",
    "googleBooks": {
      "id": "VeuWkgEACAAJ",
      "preview": "http://books.google.com/books?id=VeuWkgEACAAJ&dq=intitle:Become+an+Effective+Software+Engineering+Manager&hl=&cd=6&source=gbs_api",
      "info": "http://books.google.com/books?id=VeuWkgEACAAJ&dq=intitle:Become+an+Effective+Software+Engineering+Manager&hl=&source=gbs_api",
      "canonical": "https://books.google.com/books/about/Principles_of_Software_Engineering_Manag.html?hl=&id=VeuWkgEACAAJ"
    },
    "issueNumber": 31,
    "progressPercent": 0,
    "state": "want-to-read",
    "startedAt": "2014-04-04T00:00:00.000Z"
  },
  {
    "title": "Software Architecture in Practice",
    "authors": [
      "Len Bass",
      "Paul Clements",
      "Rick Kazman"
    ],
    "publisher": "Addison-Wesley",
    "publishedDate": "2012-09-25",
    "description": "The award-winning and highly influential Software Architecture in Practice, Third Edition, has been substantially revised to reflect the latest developments in the field. In a real-world setting, the book once again introduces the concepts and best practices of software architecture—how a software system is structured and how that system’s elements are meant to interact. Distinct from the details of implementation, algorithm, and data representation, an architecture holds the key to achieving system quality, is a reusable asset that can be applied to subsequent systems, and is crucial to a software organization’s business strategy. The authors have structured this edition around the concept of architecture influence cycles. Each cycle shows how architecture influences, and is influenced by, a particular context in which architecture plays a critical role. Contexts include technical environment, the life cycle of a project, an organization’s business profile, and the architect’s professional practices. The authors also have greatly expanded their treatment of quality attributes, which remain central to their architecture philosophy—with an entire chapter devoted to each attribute—and broadened their treatment of architectural patterns. If you design, develop, or manage large software systems (or plan to do so), you will find this book to be a valuable resource for getting up to speed on the state of the art. Totally new material covers Contexts of software architecture: technical, project, business, and professional Architecture competence: what this means both for individuals and organizations The origins of business goals and how this affects architecture Architecturally significant requirements, and how to determine them Architecture in the life cycle, including generate-and-test as a design philosophy; architecture conformance during implementation; architecture and testing; and architecture and agile development Architecture and current technologies, such as the cloud, social networks, and end-user devices",
    "image": "http://books.google.com/books/content?id=-II73rBDXCYC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
    "language": "en",
    "averageRating": 3,
    "ratingsCount": 4,
    "categories": [
      "Computers"
    ],
    "pageCount": 624,
    "isbn10": "013294278X",
    "isbn13": "9780132942782",
    "googleBooks": {
      "id": "-II73rBDXCYC",
      "preview": "http://books.google.com/books?id=-II73rBDXCYC&printsec=frontcover&dq=intitle:A+Philosophy+of+Software+Design,+2nd+Edition&hl=&cd=7&source=gbs_api",
      "info": "http://books.google.com/books?id=-II73rBDXCYC&dq=intitle:A+Philosophy+of+Software+Design,+2nd+Edition&hl=&source=gbs_api",
      "canonical": "https://books.google.com/books/about/Software_Architecture_in_Practice.html?hl=&id=-II73rBDXCYC"
    },
    "issueNumber": 29,
    "progressPercent": 0,
    "state": "want-to-read",
    "startedAt": "2013-10-12T00:00:00.000Z"
  },
  {
    "title": "14 Habits of Highly Productive Developers",
    "authors": [
      "Zeno Rocha"
    ],
    "publisher": "Zeno Rocha",
    "publishedDate": "2021-01-14",
    "description": "Why This Book? You can learn the most popular frameworks, use the best programming languages, and work at the biggest tech companies, but if you cultivate bad habits, it will be hard for you to become a top developer. This book doesn't offer a straight path or pre-defined formula of success. This book is a result of a quest. A quest to uncover what habits can be cultivated to become a better software engineer. \"I wish I had access to this book while I was starting in the software industry. The information presented is not only logical, not only personal, but very well backed up by many expert opinions throughout the book. A must-read, for both beginners and experts alike.\" - Zachary Sohovich, Software Engineer at Nike What Will You Read? How to keep up with all the new technologies What should you focus? Being a specialist or generalist? How to stay productive and not feel overwhelmed The importance of estimating tasks correctly How to approach new side project ideas And much more Who Should Read This Book? It doesn't matter if you're a Junior or Senior developer. It doesn't matter how experienced you are. This book can help you cultivate new habits or rethink existing behaviors. What's Inside? This is not a traditional book. You won't find the same format or structure that a regular book has. In fact, this book was designed to be as simple and objective as possible. You can follow the order of chapters, or you can read them individually. Everything is standalone and doesn't depend on previous knowledge. At the end of each chapter, you'll find a section marked as \"Questions & Answers\", where I interview senior developers and tech leads from various companies to understand how they got there. I went after tech giants such as Google, Amazon, Microsoft, and Adobe. Powerful startups such as GitHub, Spotify, Elastic, Segment, GoDaddy, and Shopify. All the way to established organizations such as Citibank, BlackBerry, and The New York Times. These people come from all over the world and have a pretty diverse background. From San Francisco to New York. From São Paulo to Montreal. From London to Stockholm. The idea is to present you not a one man's point of view, but a collection of insights on how to navigate your career. Who's The Author? Zeno Rocha is a Brazilian creator and programmer. He currently lives in Los Angeles, California, where he's the Chief Product Officer at Liferay Cloud. His lifelong appreciation for building software and sharing knowledge led him to speak in over 110 conferences worldwide. His passion for open source put him on the top 20 most active users on GitHub at age 22. Before moving to the US, Zeno developed multiple applications, mentored startups, and worked at major companies in Latin America, such as Globo and Petrobras.",
    "image": "http://books.google.com/books/content?id=8UUozgEACAAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api",
    "language": "en",
    "averageRating": 5,
    "ratingsCount": 1,
    "categories": [
      "Computers"
    ],
    "pageCount": 156,
    "isbn10": "1735266531",
    "isbn13": "9781735266534",
    "googleBooks": {
      "id": "8UUozgEACAAJ",
      "preview": "http://books.google.com/books?id=8UUozgEACAAJ&dq=intitle:14+Habits+of+Highly+Productive+Developers&hl=&cd=1&source=gbs_api",
      "info": "http://books.google.com/books?id=8UUozgEACAAJ&dq=intitle:14+Habits+of+Highly+Productive+Developers&hl=&source=gbs_api",
      "canonical": "https://books.google.com/books/about/14_Habits_of_Highly_Productive_Developer.html?hl=&id=8UUozgEACAAJ"
    },
    "issueNumber": 28,
    "progressPercent": 0,
    "state": "reading",
    "startedAt": "2013-04-04T00:00:00.000Z"
  },
  {
    "title": "Refactoring",
    "authors": [
      "Martin Fowler",
      "Kent Beck",
      "John Brant",
      "William Opdyke",
      "Don Roberts"
    ],
    "publisher": "Addison-Wesley",
    "publishedDate": "2012-03-09",
    "description": "As the application of object technology--particularly the Java programming language--has become commonplace, a new problem has emerged to confront the software development community. Significant numbers of poorly designed programs have been created by less-experienced developers, resulting in applications that are inefficient and hard to maintain and extend. Increasingly, software system professionals are discovering just how difficult it is to work with these inherited, \"non-optimal\" applications. For several years, expert-level object programmers have employed a growing collection of techniques to improve the structural integrity and performance of such existing software programs. Referred to as \"refactoring,\" these practices have remained in the domain of experts because no attempt has been made to transcribe the lore into a form that all developers could use. . .until now. In Refactoring: Improving the Design of Existing Code, renowned object technology mentor Martin Fowler breaks new ground, demystifying these master practices and demonstrating how software practitioners can realize the significant benefits of this new process. With proper training a skilled system designer can take a bad design and rework it into well-designed, robust code. In this book, Martin Fowler shows you where opportunities for refactoring typically can be found, and how to go about reworking a bad design into a good one. Each refactoring step is simple--seemingly too simple to be worth doing. Refactoring may involve moving a field from one class to another, or pulling some code out of a method to turn it into its own method, or even pushing some code up or down a hierarchy. While these individual steps may seem elementary, the cumulative effect of such small changes can radically improve the design. Refactoring is a proven way to prevent software decay. In addition to discussing the various techniques of refactoring, the author provides a detailed catalog of more than seventy proven refactorings with helpful pointers that teach you when to apply them; step-by-step instructions for applying each refactoring; and an example illustrating how the refactoring works. The illustrative examples are written in Java, but the ideas are applicable to any object-oriented programming language.",
    "image": "http://books.google.com/books/content?id=HmrDHwgkbPsC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
    "language": "en",
    "averageRating": 4,
    "ratingsCount": 11,
    "categories": [
      "Computers"
    ],
    "pageCount": 461,
    "isbn10": "013306526X",
    "isbn13": "9780133065268",
    "googleBooks": {
      "id": "HmrDHwgkbPsC",
      "preview": "http://books.google.com/books?id=HmrDHwgkbPsC&printsec=frontcover&dq=intitle:Refactoring:+Improving+the+Design+of+Existing+Code&hl=&cd=2&source=gbs_api",
      "info": "https://play.google.com/store/books/details?id=HmrDHwgkbPsC&source=gbs_api",
      "canonical": "https://play.google.com/store/books/details?id=HmrDHwgkbPsC"
    },
    "issueNumber": 26,
    "progressPercent": 0,
    "state": "want-to-read",
    "startedAt": "2012-12-02T00:00:00.000Z"
  }
]
